Autodesk.Revit.DB.PointClouds.PointCollection.GetPointIteratorInternal
Creates and returns an iterator for the points contained in this collection.
Returns:
New iterator created, make sure to call 'free' on it when finished using it.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCollection.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator(Autodesk.Revit.DB.PointClouds.CloudPoint) object that can be used to iterate through the collection.